# WSScript_GetObject

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.

```pascal
FUNCTION WSScript_GetObject : HANDLE;
```

```python

def vs.WSScript_GetObject():
    return HANDLE
```

## Returns
Returns the object currently being processed by the worksheet criteria at the time of the script execution.

## See Also
VS Functions:
WSScript_GetObject| WSScript_GetPrmInt| WSScript_GetPrmReal| WSScript_GetPrmStr| WSScript_SetResStr| WSScript_SetResReal| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016
## Category
* Worksheets